app/views/home/index.html.erb

								<article class="animate-box">
									<div class="blog-img" style="background-image: url(/assets/<%= place.place_pictures.first.picture %>);"></div>
---
SELECT  "place_pictures".* FROM "place_pictures" WHERE "place_pictures"."place_id" = ?  ORDER BY "place_pictures"."id" ASC LIMIT 1  [["place_id", 1]]
SELECT  "places".* FROM "places"  ORDER BY views_number desc LIMIT 5