app/views/addresses/show.html.erb

SELECT  "place_pictures".* FROM "place_pictures" WHERE "place_pictures"."place_id" = ?  ORDER BY "place_pictures"."id" ASC LIMIT 1  [["place_id", 1]]
SELECT  "places".* FROM "places" WHERE "places"."address_id" = ? LIMIT 10 OFFSET 0  [["address_id", 17]]
---
    							<article class="blog-entry-travel animate-box">
    								<div class="blog-img" style="background-image: url(/assets/<%= post.place_pictures.first.picture %>);"></div>

SELECT COUNT(*) FROM "places" WHERE "places"."address_id" = ?  [["address_id", 34]]
---
										<% @addresses.each do |address| %>
											<% if address.places.count > 0 %>