app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
SELECT  "places".* FROM "places" WHERE "places"."address_id" = ? LIMIT 10 OFFSET 0  [["address_id", 17]]
SELECT COUNT(*) FROM "places" WHERE "places"."address_id" = ?  [["address_id", 1]]
---
    def show
        @addresses = Address.all
        @reviews = @address.places.paginate(page: params[:page], per_page: 10)