app/controllers/home_controller.rb

  def index
    if params[:search]
      @result = Place.search(params[:search]).paginate(page: params[:page], per_page: 5)
    else
      @place_reviews = Place.paginate(page: params[:page], per_page: 5)
    end
    @popular_address = Address.joins(:places).group("places.address_id").order("count(places.address_id) desc").take 10
    @recent_reviews = Place.order("created_at desc").take 3
---
SELECT  "places".* FROM "places"  ORDER BY views_number desc LIMIT 5
SELECT COUNT(*) FROM "places"
SELECT  "addresses".* FROM "addresses" INNER JOIN "places" ON "places"."address_id" = "addresses"."id" GROUP BY places.address_id  ORDER BY count(places.address_id) desc LIMIT 10
SELECT  "places".* FROM "places"  ORDER BY created_at desc LIMIT 3