app/controllers/places_controller.rb

    def show
        @popular_address = Address.joins(:places).group("places.address_id").order("count(places.address_id) desc").take 10
        @related_reviews = Place.where(address_id: @place.address.id).take 4
        @same_author_reviews = Place.where(user_id: @place.user.id).take 4
---
SELECT  "addresses".* FROM "addresses" INNER JOIN "places" ON "places"."address_id" = "addresses"."id" GROUP BY places.address_id  ORDER BY count(places.address_id) desc LIMIT 10
SELECT  "places".* FROM "places" WHERE "places"."address_id" = ? LIMIT 4  [["address_id", 17]]
SELECT  "places".* FROM "places" WHERE "places"."user_id" = ? LIMIT 4  [["user_id", 1]]