app/controllers/users_controller.rb

    def update
        if @user.update_attributes user_params
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Lâm 1"], ["updated_at", "2018-10-14 02:39:07.377036"], ["id", 2]]

    def show
        @my_reviews = @user.places.paginate(page: params[:page], per_page: 6)
---
SELECT  "places".* FROM "places" WHERE "places"."user_id" = ? LIMIT 6 OFFSET 0  [["user_id", 8]]

        def find_user
            @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 8]]