app/views/places/show.html.erb

                                        <ul class="slides">
    								        <% @place.place_pictures.each do |picture| %>
---
SELECT  "place_pictures".* FROM "place_pictures" WHERE "place_pictures"."place_id" = ?  ORDER BY "place_pictures"."id" ASC LIMIT 1  [["place_id", 3]]
SELECT "places".* FROM "places" WHERE (places.user_id)

									<div class="f-blog">
										<a href="#" class="blog-img" style="background-image: url(<%= review.place_pictures.first.picture.url %>);">
---
SELECT  "places".* FROM "places" WHERE (address_id) LIMIT 4